<?php

// todo починить сохранение служебных файлов в папку ядра
// todo сделать авторизацию и разобраться с клиентами
// todo систематизировать ответы
// todo фейкер в тестах должен иметь возможность настройки локали
// todo навести порядок с контрактами, свести к минимуму контракты вокруг клиентов
// todo роуты и миграции вынести в модули
// todo настроить ограничения по длинам строк, особенно для описаний
// todo сделать менее жёсткую привязку к пагинатору ларавель
// todo user как пользователь системы и user как ученик не звучат, надо учека называть учеником
// todo переписать сиды более экономично чтобы не перебирать постоянно одно и тоже
