<?php

// todo починить сохранение служебных файлов в папку ядра
// todo сделать авторизацию и разобраться с клиентами
// todo систематизировать ответы
// todo фейкер в тестах должен иметь возможность настройки локали
// todo написать функционал каста структур друг в друга
// todo навести порядок с контрактами, свести к минимуму контракты вокруг клиентов
// todo роуты и миграции вынести в модули
// todo настроить элиасы для морфных связей
// todo настроить ограничения по длинам строк, особенно для описаний
// todo возможно для контейнеров контента понадобится ввести типы
